/*  */

say "RequiresList."

::REQUIRES "Customer\CustomerListView.rex"
::REQUIRES "Product\ProductListView.rex"
::REQUIRES "Order\OrderFormView.rex"
